import {IPost} from "../models/IPost";

export const mockPosts: IPost[] = [
  {
    id: 1,
    name: "В России снимут фильм о путешественнике Федоре Конюхове. В главной роли — Федор Бондарчук",
    text: "Главную роль в ленте, получившей название «Повелитель ветра», сыграет Федор Бондарчук. Он же вместе с Михаилом Врубелем, Александром Андрющенко и Денисом Баглаем является продюсером фильма. Режиссер ленты — Игорь Волошин («Коса»). ",
    date: "2022-02-16T12:56:52+03:00",
    approved: true
  },
  {
    id: 2,
    name: "Российские хоккеисты обыграли Данию и вышли в полуфинал Олимпиады",
    text: "Игра закончилась со счетом 3:1. У россиян шайбы забросили Вадим Шипачев (14-я минута), Никита Нестеров (35-я минута) и Вячеслав Войнов (56-я минута). У датчан на 23-й минуте отличился Франс Нильсен.",
    date: "2022-02-16T12:56:52+03:00",
    approved: false
  },
  {
    id: 3,
    name: "В Башкирии пчеловоды устроили акцию против передачи земель французским инвесторам. Они опасаются вымирания местных пчел",
    text: "Акция состоялась 20 февраля. Цепочка флешмоба растянулась на несколько километров по трассе между деревнями Макарово и Исякаево. По оценкам «Idel.Реалии», собралось около полутора тысяч человек, среди которых — местные пчеловоды, сельчане и активисты, поддерживающие их. По данным издания, во время акции люди скандировали: «На своей земле — мы сами хозяева!».",
    date: "2022-02-16T12:56:52+03:00",
    approved: true
  },
  {
    id: 4,
    name: "Начали выдавать QR-коды по антителам в России",
    text: "Тест на антитела, говорили ранее в министерстве, можно сдать в любой лицензированной лаборатории. Требования к уровню антител к вирусу для получения QR-кода не устанавливаются, достаточно их наличия.",
    date: "2022-02-16T12:56:52+03:00",
    approved: true
  },
  {
    id: 5,
    name: "Российские хоккеисты проиграли Финляндии в финале Олимпиады. В общекомандном зачете по итогам Игр россияне заняли девятое место",
    text: "Сборная России по хоккею проиграла финальный матч Олимпиады сборной Финляндии и получила серебряные медали.\n" +
      "\n" +
      "Встреча закончилась со счетом 2:1 в пользу финнов.\n" +
      "\n" +
      "Счет в середине первого периода открыл Михаил Григоренко, однако затем россияне пропустили по одной шайбе в начале каждого из оставшихся двух периодов.",
    date: "2022-02-16T12:56:52+03:00",
    approved: false
  },
  {
    id: 6,
    name: "В России снимут фильм о путешественнике Федоре Конюхове. В главной роли — Федор Бондарчук",
    text: "Главную роль в ленте, получившей название «Повелитель ветра», сыграет Федор Бондарчук. Он же вместе с Михаилом Врубелем, Александром Андрющенко и Денисом Баглаем является продюсером фильма. Режиссер ленты — Игорь Волошин («Коса»). ",
    date: "2022-02-16T12:56:52+03:00",
    approved: true
  },
  {
    id: 7,
    name: "Российские хоккеисты обыграли Данию и вышли в полуфинал Олимпиады",
    text: "Игра закончилась со счетом 3:1. У россиян шайбы забросили Вадим Шипачев (14-я минута), Никита Нестеров (35-я минута) и Вячеслав Войнов (56-я минута). У датчан на 23-й минуте отличился Франс Нильсен.",
    date: "2022-02-16T12:56:52+03:00",
    approved: false
  },
  {
    id: 8,
    name: "В Башкирии пчеловоды устроили акцию против передачи земель французским инвесторам. Они опасаются вымирания местных пчел",
    text: "Акция состоялась 20 февраля. Цепочка флешмоба растянулась на несколько километров по трассе между деревнями Макарово и Исякаево. По оценкам «Idel.Реалии», собралось около полутора тысяч человек, среди которых — местные пчеловоды, сельчане и активисты, поддерживающие их. По данным издания, во время акции люди скандировали: «На своей земле — мы сами хозяева!».",
    date: "2022-02-16T12:56:52+03:00",
    approved: true
  },
  {
    id: 9,
    name: "Начали выдавать QR-коды по антителам в России",
    text: "Тест на антитела, говорили ранее в министерстве, можно сдать в любой лицензированной лаборатории. Требования к уровню антител к вирусу для получения QR-кода не устанавливаются, достаточно их наличия.",
    date: "2022-02-16T12:56:52+03:00",
    approved: true
  },
  {
    id: 10,
    name: "Российские хоккеисты проиграли Финляндии в финале Олимпиады. В общекомандном зачете по итогам Игр россияне заняли девятое место",
    text: "Сборная России по хоккею проиграла финальный матч Олимпиады сборной Финляндии и получила серебряные медали.\n" +
      "\n" +
      "Встреча закончилась со счетом 2:1 в пользу финнов.\n" +
      "\n" +
      "Счет в середине первого периода открыл Михаил Григоренко, однако затем россияне пропустили по одной шайбе в начале каждого из оставшихся двух периодов.",
    date: "2022-02-16T12:56:52+03:00",
    approved: true
  }
]
